zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/uart.h
/**
 * \brief Component description for PIC32CZ/CA70 UART
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_UART_COMPONENT_H_
#define _PIC32CZ_CA70_UART_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_UART Universal Asynchronous Receiver Transmitter
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR UART */
/* ========================================================================== */

/* -------- UART_CR : (UART Offset: 0x00) (/W 32) Control Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t RSTRX:1;                   /**< bit:      2  Reset Receiver                                */
    uint32_t RSTTX:1;                   /**< bit:      3  Reset Transmitter                             */
    uint32_t RXEN:1;                    /**< bit:      4  Receiver Enable                               */
    uint32_t RXDIS:1;                   /**< bit:      5  Receiver Disable                              */
    uint32_t TXEN:1;                    /**< bit:      6  Transmitter Enable                            */
    uint32_t TXDIS:1;                   /**< bit:      7  Transmitter Disable                           */
    uint32_t RSTSTA:1;                  /**< bit:      8  Reset Status                                  */
    uint32_t :3;                        /**< bit:  9..11  Reserved                                      */
    uint32_t REQCLR:1;                  /**< bit:     12  Request Clear                                 */
    uint32_t :2;                        /**< bit: 13..14  Reserved                                      */
    uint32_t DBGE:1;                    /**< bit:     15  Debug Enable                                  */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __UART_CR_bits_t;

#define UART_CR_RSTRX_Pos                     (2)                                            /**< (UART_CR) Reset Receiver Position */
#define UART_CR_RSTRX_Msk                     (0x1U << UART_CR_RSTRX_Pos)                    /**< (UART_CR) Reset Receiver Mask */
#define UART_CR_RSTTX_Pos                     (3)                                            /**< (UART_CR) Reset Transmitter Position */
#define UART_CR_RSTTX_Msk                     (0x1U << UART_CR_RSTTX_Pos)                    /**< (UART_CR) Reset Transmitter Mask */
#define UART_CR_RXEN_Pos                      (4)                                            /**< (UART_CR) Receiver Enable Position */
#define UART_CR_RXEN_Msk                      (0x1U << UART_CR_RXEN_Pos)                     /**< (UART_CR) Receiver Enable Mask */
#define UART_CR_RXDIS_Pos                     (5)                                            /**< (UART_CR) Receiver Disable Position */
#define UART_CR_RXDIS_Msk                     (0x1U << UART_CR_RXDIS_Pos)                    /**< (UART_CR) Receiver Disable Mask */
#define UART_CR_TXEN_Pos                      (6)                                            /**< (UART_CR) Transmitter Enable Position */
#define UART_CR_TXEN_Msk                      (0x1U << UART_CR_TXEN_Pos)                     /**< (UART_CR) Transmitter Enable Mask */
#define UART_CR_TXDIS_Pos                     (7)                                            /**< (UART_CR) Transmitter Disable Position */
#define UART_CR_TXDIS_Msk                     (0x1U << UART_CR_TXDIS_Pos)                    /**< (UART_CR) Transmitter Disable Mask */
#define UART_CR_RSTSTA_Pos                    (8)                                            /**< (UART_CR) Reset Status Position */
#define UART_CR_RSTSTA_Msk                    (0x1U << UART_CR_RSTSTA_Pos)                   /**< (UART_CR) Reset Status Mask */
#define UART_CR_REQCLR_Pos                    (12)                                           /**< (UART_CR) Request Clear Position */
#define UART_CR_REQCLR_Msk                    (0x1U << UART_CR_REQCLR_Pos)                   /**< (UART_CR) Request Clear Mask */
#define UART_CR_DBGE_Pos                      (15)                                           /**< (UART_CR) Debug Enable Position */
#define UART_CR_DBGE_Msk                      (0x1U << UART_CR_DBGE_Pos)                     /**< (UART_CR) Debug Enable Mask */
#define UART_CR_Msk                           (0x000091FCUL)                                 /**< (UART_CR) Register Mask  */

/* -------- UART_MR : (UART Offset: 0x04) (R/W 32) Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t :4;                        /**< bit:   0..3  Reserved                                      */
    uint32_t FILTER:1;                  /**< bit:      4  Receiver Digital Filter                       */
    uint32_t :4;                        /**< bit:   5..8  Reserved                                      */
    uint32_t PAR:3;                     /**< bit:  9..11  Parity Type                                   */
    uint32_t BRSRCCK:1;                 /**< bit:     12  Baud Rate Source Clock                        */
    uint32_t :1;                        /**< bit:     13  Reserved                                      */
    uint32_t CHMODE:2;                  /**< bit: 14..15  Channel Mode                                  */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __UART_MR_bits_t;

#define UART_MR_FILTER_Pos                    (4)                                            /**< (UART_MR) Receiver Digital Filter Position */
#define UART_MR_FILTER_Msk                    (0x1U << UART_MR_FILTER_Pos)                   /**< (UART_MR) Receiver Digital Filter Mask */
#define   UART_MR_FILTER_DISABLED_Val         (0x0U)                                         /**< (UART_MR) UART does not filter the receive line.  */
#define   UART_MR_FILTER_ENABLED_Val          (0x1U)                                         /**< (UART_MR) UART filters the receive line using a three-sample filter (16x-bit clock) (2 over 3 majority).  */
#define UART_MR_FILTER_DISABLED               (UART_MR_FILTER_DISABLED_Val << UART_MR_FILTER_Pos)  /**< (UART_MR) UART does not filter the receive line. Position  */
#define UART_MR_FILTER_ENABLED                (UART_MR_FILTER_ENABLED_Val << UART_MR_FILTER_Pos)  /**< (UART_MR) UART filters the receive line using a three-sample filter (16x-bit clock) (2 over 3 majority). Position  */
#define UART_MR_PAR_Pos                       (9)                                            /**< (UART_MR) Parity Type Position */
#define UART_MR_PAR_Msk                       (0x7U << UART_MR_PAR_Pos)                      /**< (UART_MR) Parity Type Mask */
#define UART_MR_PAR(value)                    (UART_MR_PAR_Msk & ((value) << UART_MR_PAR_Pos))
#define   UART_MR_PAR_EVEN_Val                (0x0U)                                         /**< (UART_MR) Even Parity  */
#define   UART_MR_PAR_ODD_Val                 (0x1U)                                         /**< (UART_MR) Odd Parity  */
#define   UART_MR_PAR_SPACE_Val               (0x2U)                                         /**< (UART_MR) Space: parity forced to 0  */
#define   UART_MR_PAR_MARK_Val                (0x3U)                                         /**< (UART_MR) Mark: parity forced to 1  */
#define   UART_MR_PAR_NO_Val                  (0x4U)                                         /**< (UART_MR) No parity  */
#define UART_MR_PAR_EVEN                      (UART_MR_PAR_EVEN_Val << UART_MR_PAR_Pos)      /**< (UART_MR) Even Parity Position  */
#define UART_MR_PAR_ODD                       (UART_MR_PAR_ODD_Val << UART_MR_PAR_Pos)       /**< (UART_MR) Odd Parity Position  */
#define UART_MR_PAR_SPACE                     (UART_MR_PAR_SPACE_Val << UART_MR_PAR_Pos)     /**< (UART_MR) Space: parity forced to 0 Position  */
#define UART_MR_PAR_MARK                      (UART_MR_PAR_MARK_Val << UART_MR_PAR_Pos)      /**< (UART_MR) Mark: parity forced to 1 Position  */
#define UART_MR_PAR_NO                        (UART_MR_PAR_NO_Val << UART_MR_PAR_Pos)        /**< (UART_MR) No parity Position  */
#define UART_MR_BRSRCCK_Pos                   (12)                                           /**< (UART_MR) Baud Rate Source Clock Position */
#define UART_MR_BRSRCCK_Msk                   (0x1U << UART_MR_BRSRCCK_Pos)                  /**< (UART_MR) Baud Rate Source Clock Mask */
#define   UART_MR_BRSRCCK_PERIPH_CLK_Val      (0x0U)                                         /**< (UART_MR) The baud rate is driven by the peripheral clock  */
#define   UART_MR_BRSRCCK_PMC_PCK_Val         (0x1U)                                         /**< (UART_MR) The baud rate is driven by a PMC-programmable clock PCK (see section Power Management Controller (PMC)).  */
#define UART_MR_BRSRCCK_PERIPH_CLK            (UART_MR_BRSRCCK_PERIPH_CLK_Val << UART_MR_BRSRCCK_Pos)  /**< (UART_MR) The baud rate is driven by the peripheral clock Position  */
#define UART_MR_BRSRCCK_PMC_PCK               (UART_MR_BRSRCCK_PMC_PCK_Val << UART_MR_BRSRCCK_Pos)  /**< (UART_MR) The baud rate is driven by a PMC-programmable clock PCK (see section Power Management Controller (PMC)). Position  */
#define UART_MR_CHMODE_Pos                    (14)                                           /**< (UART_MR) Channel Mode Position */
#define UART_MR_CHMODE_Msk                    (0x3U << UART_MR_CHMODE_Pos)                   /**< (UART_MR) Channel Mode Mask */
#define UART_MR_CHMODE(value)                 (UART_MR_CHMODE_Msk & ((value) << UART_MR_CHMODE_Pos))
#define   UART_MR_CHMODE_NORMAL_Val           (0x0U)                                         /**< (UART_MR) Normal mode  */
#define   UART_MR_CHMODE_AUTOMATIC_Val        (0x1U)                                         /**< (UART_MR) Automatic echo  */
#define   UART_MR_CHMODE_LOCAL_LOOPBACK_Val   (0x2U)                                         /**< (UART_MR) Local loopback  */
#define   UART_MR_CHMODE_REMOTE_LOOPBACK_Val  (0x3U)                                         /**< (UART_MR) Remote loopback  */
#define UART_MR_CHMODE_NORMAL                 (UART_MR_CHMODE_NORMAL_Val << UART_MR_CHMODE_Pos)  /**< (UART_MR) Normal mode Position  */
#define UART_MR_CHMODE_AUTOMATIC              (UART_MR_CHMODE_AUTOMATIC_Val << UART_MR_CHMODE_Pos)  /**< (UART_MR) Automatic echo Position  */
#define UART_MR_CHMODE_LOCAL_LOOPBACK         (UART_MR_CHMODE_LOCAL_LOOPBACK_Val << UART_MR_CHMODE_Pos)  /**< (UART_MR) Local loopback Position  */
#define UART_MR_CHMODE_REMOTE_LOOPBACK        (UART_MR_CHMODE_REMOTE_LOOPBACK_Val << UART_MR_CHMODE_Pos)  /**< (UART_MR) Remote loopback Position  */
#define UART_MR_Msk                           (0x0000DE10UL)                                 /**< (UART_MR) Register Mask  */

