zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/uart.h
/* -------- UART_IER : (UART Offset: 0x08) (/W 32) Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t RXRDY:1;                   /**< bit:      0  Enable RXRDY Interrupt                        */
    uint32_t TXRDY:1;                   /**< bit:      1  Enable TXRDY Interrupt                        */
    uint32_t :3;                        /**< bit:   2..4  Reserved                                      */
    uint32_t OVRE:1;                    /**< bit:      5  Enable Overrun Error Interrupt                */
    uint32_t FRAME:1;                   /**< bit:      6  Enable Framing Error Interrupt                */
    uint32_t PARE:1;                    /**< bit:      7  Enable Parity Error Interrupt                 */
    uint32_t :1;                        /**< bit:      8  Reserved                                      */
    uint32_t TXEMPTY:1;                 /**< bit:      9  Enable TXEMPTY Interrupt                      */
    uint32_t :5;                        /**< bit: 10..14  Reserved                                      */
    uint32_t CMP:1;                     /**< bit:     15  Enable Comparison Interrupt                   */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __UART_IER_bits_t;

#define UART_IER_RXRDY_Pos                    (0)                                            /**< (UART_IER) Enable RXRDY Interrupt Position */
#define UART_IER_RXRDY_Msk                    (0x1U << UART_IER_RXRDY_Pos)                   /**< (UART_IER) Enable RXRDY Interrupt Mask */
#define UART_IER_TXRDY_Pos                    (1)                                            /**< (UART_IER) Enable TXRDY Interrupt Position */
#define UART_IER_TXRDY_Msk                    (0x1U << UART_IER_TXRDY_Pos)                   /**< (UART_IER) Enable TXRDY Interrupt Mask */
#define UART_IER_OVRE_Pos                     (5)                                            /**< (UART_IER) Enable Overrun Error Interrupt Position */
#define UART_IER_OVRE_Msk                     (0x1U << UART_IER_OVRE_Pos)                    /**< (UART_IER) Enable Overrun Error Interrupt Mask */
#define UART_IER_FRAME_Pos                    (6)                                            /**< (UART_IER) Enable Framing Error Interrupt Position */
#define UART_IER_FRAME_Msk                    (0x1U << UART_IER_FRAME_Pos)                   /**< (UART_IER) Enable Framing Error Interrupt Mask */
#define UART_IER_PARE_Pos                     (7)                                            /**< (UART_IER) Enable Parity Error Interrupt Position */
#define UART_IER_PARE_Msk                     (0x1U << UART_IER_PARE_Pos)                    /**< (UART_IER) Enable Parity Error Interrupt Mask */
#define UART_IER_TXEMPTY_Pos                  (9)                                            /**< (UART_IER) Enable TXEMPTY Interrupt Position */
#define UART_IER_TXEMPTY_Msk                  (0x1U << UART_IER_TXEMPTY_Pos)                 /**< (UART_IER) Enable TXEMPTY Interrupt Mask */
#define UART_IER_CMP_Pos                      (15)                                           /**< (UART_IER) Enable Comparison Interrupt Position */
#define UART_IER_CMP_Msk                      (0x1U << UART_IER_CMP_Pos)                     /**< (UART_IER) Enable Comparison Interrupt Mask */
#define UART_IER_Msk                          (0x000082E3UL)                                 /**< (UART_IER) Register Mask  */

/* -------- UART_IDR : (UART Offset: 0x0c) (/W 32) Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t RXRDY:1;                   /**< bit:      0  Disable RXRDY Interrupt                       */
    uint32_t TXRDY:1;                   /**< bit:      1  Disable TXRDY Interrupt                       */
    uint32_t :3;                        /**< bit:   2..4  Reserved                                      */
    uint32_t OVRE:1;                    /**< bit:      5  Disable Overrun Error Interrupt               */
    uint32_t FRAME:1;                   /**< bit:      6  Disable Framing Error Interrupt               */
    uint32_t PARE:1;                    /**< bit:      7  Disable Parity Error Interrupt                */
    uint32_t :1;                        /**< bit:      8  Reserved                                      */
    uint32_t TXEMPTY:1;                 /**< bit:      9  Disable TXEMPTY Interrupt                     */
    uint32_t :5;                        /**< bit: 10..14  Reserved                                      */
    uint32_t CMP:1;                     /**< bit:     15  Disable Comparison Interrupt                  */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __UART_IDR_bits_t;

#define UART_IDR_RXRDY_Pos                    (0)                                            /**< (UART_IDR) Disable RXRDY Interrupt Position */
#define UART_IDR_RXRDY_Msk                    (0x1U << UART_IDR_RXRDY_Pos)                   /**< (UART_IDR) Disable RXRDY Interrupt Mask */
#define UART_IDR_TXRDY_Pos                    (1)                                            /**< (UART_IDR) Disable TXRDY Interrupt Position */
#define UART_IDR_TXRDY_Msk                    (0x1U << UART_IDR_TXRDY_Pos)                   /**< (UART_IDR) Disable TXRDY Interrupt Mask */
#define UART_IDR_OVRE_Pos                     (5)                                            /**< (UART_IDR) Disable Overrun Error Interrupt Position */
#define UART_IDR_OVRE_Msk                     (0x1U << UART_IDR_OVRE_Pos)                    /**< (UART_IDR) Disable Overrun Error Interrupt Mask */
#define UART_IDR_FRAME_Pos                    (6)                                            /**< (UART_IDR) Disable Framing Error Interrupt Position */
#define UART_IDR_FRAME_Msk                    (0x1U << UART_IDR_FRAME_Pos)                   /**< (UART_IDR) Disable Framing Error Interrupt Mask */
#define UART_IDR_PARE_Pos                     (7)                                            /**< (UART_IDR) Disable Parity Error Interrupt Position */
#define UART_IDR_PARE_Msk                     (0x1U << UART_IDR_PARE_Pos)                    /**< (UART_IDR) Disable Parity Error Interrupt Mask */
#define UART_IDR_TXEMPTY_Pos                  (9)                                            /**< (UART_IDR) Disable TXEMPTY Interrupt Position */
#define UART_IDR_TXEMPTY_Msk                  (0x1U << UART_IDR_TXEMPTY_Pos)                 /**< (UART_IDR) Disable TXEMPTY Interrupt Mask */
#define UART_IDR_CMP_Pos                      (15)                                           /**< (UART_IDR) Disable Comparison Interrupt Position */
#define UART_IDR_CMP_Msk                      (0x1U << UART_IDR_CMP_Pos)                     /**< (UART_IDR) Disable Comparison Interrupt Mask */
#define UART_IDR_Msk                          (0x000082E3UL)                                 /**< (UART_IDR) Register Mask  */

/* -------- UART_IMR : (UART Offset: 0x10) (R/ 32) Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t RXRDY:1;                   /**< bit:      0  Mask RXRDY Interrupt                          */
    uint32_t TXRDY:1;                   /**< bit:      1  Disable TXRDY Interrupt                       */
    uint32_t :3;                        /**< bit:   2..4  Reserved                                      */
    uint32_t OVRE:1;                    /**< bit:      5  Mask Overrun Error Interrupt                  */
    uint32_t FRAME:1;                   /**< bit:      6  Mask Framing Error Interrupt                  */
    uint32_t PARE:1;                    /**< bit:      7  Mask Parity Error Interrupt                   */
    uint32_t :1;                        /**< bit:      8  Reserved                                      */
    uint32_t TXEMPTY:1;                 /**< bit:      9  Mask TXEMPTY Interrupt                        */
    uint32_t :5;                        /**< bit: 10..14  Reserved                                      */
    uint32_t CMP:1;                     /**< bit:     15  Mask Comparison Interrupt                     */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __UART_IMR_bits_t;

#define UART_IMR_RXRDY_Pos                    (0)                                            /**< (UART_IMR) Mask RXRDY Interrupt Position */
#define UART_IMR_RXRDY_Msk                    (0x1U << UART_IMR_RXRDY_Pos)                   /**< (UART_IMR) Mask RXRDY Interrupt Mask */
#define UART_IMR_TXRDY_Pos                    (1)                                            /**< (UART_IMR) Disable TXRDY Interrupt Position */
#define UART_IMR_TXRDY_Msk                    (0x1U << UART_IMR_TXRDY_Pos)                   /**< (UART_IMR) Disable TXRDY Interrupt Mask */
#define UART_IMR_OVRE_Pos                     (5)                                            /**< (UART_IMR) Mask Overrun Error Interrupt Position */
#define UART_IMR_OVRE_Msk                     (0x1U << UART_IMR_OVRE_Pos)                    /**< (UART_IMR) Mask Overrun Error Interrupt Mask */
#define UART_IMR_FRAME_Pos                    (6)                                            /**< (UART_IMR) Mask Framing Error Interrupt Position */
#define UART_IMR_FRAME_Msk                    (0x1U << UART_IMR_FRAME_Pos)                   /**< (UART_IMR) Mask Framing Error Interrupt Mask */
#define UART_IMR_PARE_Pos                     (7)                                            /**< (UART_IMR) Mask Parity Error Interrupt Position */
#define UART_IMR_PARE_Msk                     (0x1U << UART_IMR_PARE_Pos)                    /**< (UART_IMR) Mask Parity Error Interrupt Mask */
#define UART_IMR_TXEMPTY_Pos                  (9)                                            /**< (UART_IMR) Mask TXEMPTY Interrupt Position */
#define UART_IMR_TXEMPTY_Msk                  (0x1U << UART_IMR_TXEMPTY_Pos)                 /**< (UART_IMR) Mask TXEMPTY Interrupt Mask */
#define UART_IMR_CMP_Pos                      (15)                                           /**< (UART_IMR) Mask Comparison Interrupt Position */
#define UART_IMR_CMP_Msk                      (0x1U << UART_IMR_CMP_Pos)                     /**< (UART_IMR) Mask Comparison Interrupt Mask */
#define UART_IMR_Msk                          (0x000082E3UL)                                 /**< (UART_IMR) Register Mask  */

