zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/uart.h
/* -------- UART_SR : (UART Offset: 0x14) (R/ 32) Status Register -------- */

typedef union
{
  struct
  {
    uint32_t RXRDY:1;                   /**< bit:      0  Receiver Ready                                */
    uint32_t TXRDY:1;                   /**< bit:      1  Transmitter Ready                             */
    uint32_t :3;                        /**< bit:   2..4  Reserved                                      */
    uint32_t OVRE:1;                    /**< bit:      5  Overrun Error                                 */
    uint32_t FRAME:1;                   /**< bit:      6  Framing Error                                 */
    uint32_t PARE:1;                    /**< bit:      7  Parity Error                                  */
    uint32_t :1;                        /**< bit:      8  Reserved                                      */
    uint32_t TXEMPTY:1;                 /**< bit:      9  Transmitter Empty                             */
    uint32_t :5;                        /**< bit: 10..14  Reserved                                      */
    uint32_t CMP:1;                     /**< bit:     15  Comparison Match                              */
    uint32_t :5;                        /**< bit: 16..20  Reserved                                      */
    uint32_t SWES:1;                    /**< bit:     21  SleepWalking Enable Status                    */
    uint32_t CLKREQ:1;                  /**< bit:     22  Clock Request                                 */
    uint32_t WKUPREQ:1;                 /**< bit:     23  Wake-Up Request                               */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __UART_SR_bits_t;

#define UART_SR_RXRDY_Pos                     (0)                                            /**< (UART_SR) Receiver Ready Position */
#define UART_SR_RXRDY_Msk                     (0x1U << UART_SR_RXRDY_Pos)                    /**< (UART_SR) Receiver Ready Mask */
#define UART_SR_TXRDY_Pos                     (1)                                            /**< (UART_SR) Transmitter Ready Position */
#define UART_SR_TXRDY_Msk                     (0x1U << UART_SR_TXRDY_Pos)                    /**< (UART_SR) Transmitter Ready Mask */
#define UART_SR_OVRE_Pos                      (5)                                            /**< (UART_SR) Overrun Error Position */
#define UART_SR_OVRE_Msk                      (0x1U << UART_SR_OVRE_Pos)                     /**< (UART_SR) Overrun Error Mask */
#define UART_SR_FRAME_Pos                     (6)                                            /**< (UART_SR) Framing Error Position */
#define UART_SR_FRAME_Msk                     (0x1U << UART_SR_FRAME_Pos)                    /**< (UART_SR) Framing Error Mask */
#define UART_SR_PARE_Pos                      (7)                                            /**< (UART_SR) Parity Error Position */
#define UART_SR_PARE_Msk                      (0x1U << UART_SR_PARE_Pos)                     /**< (UART_SR) Parity Error Mask */
#define UART_SR_TXEMPTY_Pos                   (9)                                            /**< (UART_SR) Transmitter Empty Position */
#define UART_SR_TXEMPTY_Msk                   (0x1U << UART_SR_TXEMPTY_Pos)                  /**< (UART_SR) Transmitter Empty Mask */
#define UART_SR_CMP_Pos                       (15)                                           /**< (UART_SR) Comparison Match Position */
#define UART_SR_CMP_Msk                       (0x1U << UART_SR_CMP_Pos)                      /**< (UART_SR) Comparison Match Mask */
#define UART_SR_SWES_Pos                      (21)                                           /**< (UART_SR) SleepWalking Enable Status Position */
#define UART_SR_SWES_Msk                      (0x1U << UART_SR_SWES_Pos)                     /**< (UART_SR) SleepWalking Enable Status Mask */
#define UART_SR_CLKREQ_Pos                    (22)                                           /**< (UART_SR) Clock Request Position */
#define UART_SR_CLKREQ_Msk                    (0x1U << UART_SR_CLKREQ_Pos)                   /**< (UART_SR) Clock Request Mask */
#define UART_SR_WKUPREQ_Pos                   (23)                                           /**< (UART_SR) Wake-Up Request Position */
#define UART_SR_WKUPREQ_Msk                   (0x1U << UART_SR_WKUPREQ_Pos)                  /**< (UART_SR) Wake-Up Request Mask */
#define UART_SR_Msk                           (0x00E082E3UL)                                 /**< (UART_SR) Register Mask  */

/* -------- UART_RHR : (UART Offset: 0x18) (R/ 32) Receive Holding Register -------- */

typedef union
{
  struct
  {
    uint32_t RXCHR:8;                   /**< bit:   0..7  Received Character                            */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __UART_RHR_bits_t;

#define UART_RHR_RXCHR_Pos                    (0)                                            /**< (UART_RHR) Received Character Position */
#define UART_RHR_RXCHR_Msk                    (0xFFU << UART_RHR_RXCHR_Pos)                  /**< (UART_RHR) Received Character Mask */
#define UART_RHR_RXCHR(value)                 (UART_RHR_RXCHR_Msk & ((value) << UART_RHR_RXCHR_Pos))
#define UART_RHR_Msk                          (0x000000FFUL)                                 /**< (UART_RHR) Register Mask  */

/* -------- UART_THR : (UART Offset: 0x1c) (/W 32) Transmit Holding Register -------- */

typedef union
{
  struct
  {
    uint32_t TXCHR:8;                   /**< bit:   0..7  Character to be Transmitted                   */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __UART_THR_bits_t;

#define UART_THR_TXCHR_Pos                    (0)                                            /**< (UART_THR) Character to be Transmitted Position */
#define UART_THR_TXCHR_Msk                    (0xFFU << UART_THR_TXCHR_Pos)                  /**< (UART_THR) Character to be Transmitted Mask */
#define UART_THR_TXCHR(value)                 (UART_THR_TXCHR_Msk & ((value) << UART_THR_TXCHR_Pos))
#define UART_THR_Msk                          (0x000000FFUL)                                 /**< (UART_THR) Register Mask  */

/* -------- UART_BRGR : (UART Offset: 0x20) (R/W 32) Baud Rate Generator Register -------- */

typedef union
{
  struct
  {
    uint32_t CD:16;                     /**< bit:  0..15  Clock Divisor                                 */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __UART_BRGR_bits_t;

#define UART_BRGR_CD_Pos                      (0)                                            /**< (UART_BRGR) Clock Divisor Position */
#define UART_BRGR_CD_Msk                      (0xFFFFU << UART_BRGR_CD_Pos)                  /**< (UART_BRGR) Clock Divisor Mask */
#define UART_BRGR_CD(value)                   (UART_BRGR_CD_Msk & ((value) << UART_BRGR_CD_Pos))
#define UART_BRGR_Msk                         (0x0000FFFFUL)                                 /**< (UART_BRGR) Register Mask  */

/* -------- UART_CMPR : (UART Offset: 0x24) (R/W 32) Comparison Register -------- */

typedef union
{
  struct
  {
    uint32_t VAL1:8;                    /**< bit:   0..7  First Comparison Value for Received Character */
    uint32_t :4;                        /**< bit:  8..11  Reserved                                      */
    uint32_t CMPMODE:1;                 /**< bit:     12  Comparison Mode                               */
    uint32_t :1;                        /**< bit:     13  Reserved                                      */
    uint32_t CMPPAR:1;                  /**< bit:     14  Compare Parity                                */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t VAL2:8;                    /**< bit: 16..23  Second Comparison Value for Received Character */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __UART_CMPR_bits_t;

