zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/uart.h
#define UART_CMPR_VAL1_Pos                    (0)                                            /**< (UART_CMPR) First Comparison Value for Received Character Position */
#define UART_CMPR_VAL1_Msk                    (0xFFU << UART_CMPR_VAL1_Pos)                  /**< (UART_CMPR) First Comparison Value for Received Character Mask */
#define UART_CMPR_VAL1(value)                 (UART_CMPR_VAL1_Msk & ((value) << UART_CMPR_VAL1_Pos))
#define UART_CMPR_CMPMODE_Pos                 (12)                                           /**< (UART_CMPR) Comparison Mode Position */
#define UART_CMPR_CMPMODE_Msk                 (0x1U << UART_CMPR_CMPMODE_Pos)                /**< (UART_CMPR) Comparison Mode Mask */
#define   UART_CMPR_CMPMODE_FLAG_ONLY_Val     (0x0U)                                         /**< (UART_CMPR) Any character is received and comparison function drives CMP flag.  */
#define   UART_CMPR_CMPMODE_START_CONDITION_Val (0x1U)                                         /**< (UART_CMPR) Comparison condition must be met to start reception.  */
#define UART_CMPR_CMPMODE_FLAG_ONLY           (UART_CMPR_CMPMODE_FLAG_ONLY_Val << UART_CMPR_CMPMODE_Pos)  /**< (UART_CMPR) Any character is received and comparison function drives CMP flag. Position  */
#define UART_CMPR_CMPMODE_START_CONDITION     (UART_CMPR_CMPMODE_START_CONDITION_Val << UART_CMPR_CMPMODE_Pos)  /**< (UART_CMPR) Comparison condition must be met to start reception. Position  */
#define UART_CMPR_CMPPAR_Pos                  (14)                                           /**< (UART_CMPR) Compare Parity Position */
#define UART_CMPR_CMPPAR_Msk                  (0x1U << UART_CMPR_CMPPAR_Pos)                 /**< (UART_CMPR) Compare Parity Mask */
#define UART_CMPR_VAL2_Pos                    (16)                                           /**< (UART_CMPR) Second Comparison Value for Received Character Position */
#define UART_CMPR_VAL2_Msk                    (0xFFU << UART_CMPR_VAL2_Pos)                  /**< (UART_CMPR) Second Comparison Value for Received Character Mask */
#define UART_CMPR_VAL2(value)                 (UART_CMPR_VAL2_Msk & ((value) << UART_CMPR_VAL2_Pos))
#define UART_CMPR_Msk                         (0x00FF50FFUL)                                 /**< (UART_CMPR) Register Mask  */

/* -------- UART_WPMR : (UART Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                          */
  };
  uint32_t w;
} __UART_WPMR_bits_t;

#define UART_WPMR_WPEN_Pos                    (0)                                            /**< (UART_WPMR) Write Protection Enable Position */
#define UART_WPMR_WPEN_Msk                    (0x1U << UART_WPMR_WPEN_Pos)                   /**< (UART_WPMR) Write Protection Enable Mask */
#define UART_WPMR_WPKEY_Pos                   (8)                                            /**< (UART_WPMR) Write Protection Key Position */
#define UART_WPMR_WPKEY_Msk                   (0xFFFFFFU << UART_WPMR_WPKEY_Pos)             /**< (UART_WPMR) Write Protection Key Mask */
#define UART_WPMR_WPKEY(value)                (UART_WPMR_WPKEY_Msk & ((value) << UART_WPMR_WPKEY_Pos))
#define   UART_WPMR_WPKEY_PASSWD_Val          (0x554152U)                                    /**< (UART_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define UART_WPMR_WPKEY_PASSWD                (UART_WPMR_WPKEY_PASSWD_Val << UART_WPMR_WPKEY_Pos)  /**< (UART_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define UART_WPMR_Msk                         (0xFFFFFF01UL)                                 /**< (UART_WPMR) Register Mask  */

/** \brief UART register offsets definitions */
#define UART_CR_OFFSET               (0x00)         /**< (UART_CR) Control Register Offset */
#define UART_MR_OFFSET               (0x04)         /**< (UART_MR) Mode Register Offset */
#define UART_IER_OFFSET              (0x08)         /**< (UART_IER) Interrupt Enable Register Offset */
#define UART_IDR_OFFSET              (0x0C)         /**< (UART_IDR) Interrupt Disable Register Offset */
#define UART_IMR_OFFSET              (0x10)         /**< (UART_IMR) Interrupt Mask Register Offset */
#define UART_SR_OFFSET               (0x14)         /**< (UART_SR) Status Register Offset */
#define UART_RHR_OFFSET              (0x18)         /**< (UART_RHR) Receive Holding Register Offset */
#define UART_THR_OFFSET              (0x1C)         /**< (UART_THR) Transmit Holding Register Offset */
#define UART_BRGR_OFFSET             (0x20)         /**< (UART_BRGR) Baud Rate Generator Register Offset */
#define UART_CMPR_OFFSET             (0x24)         /**< (UART_CMPR) Comparison Register Offset */
#define UART_WPMR_OFFSET             (0xE4)         /**< (UART_WPMR) Write Protection Mode Register Offset */

/** \brief UART register API structure */
typedef struct
{
  __O   __UART_CR_bits_t               UART_CR;       /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  __UART_MR_bits_t               UART_MR;       /**< Offset: 0x04 (R/W  32) Mode Register */
  __O   __UART_IER_bits_t              UART_IER;      /**< Offset: 0x08 ( /W  32) Interrupt Enable Register */
  __O   __UART_IDR_bits_t              UART_IDR;      /**< Offset: 0x0C ( /W  32) Interrupt Disable Register */
  __I   __UART_IMR_bits_t              UART_IMR;      /**< Offset: 0x10 (R/   32) Interrupt Mask Register */
  __I   __UART_SR_bits_t               UART_SR;       /**< Offset: 0x14 (R/   32) Status Register */
  __I   __UART_RHR_bits_t              UART_RHR;      /**< Offset: 0x18 (R/   32) Receive Holding Register */
  __O   __UART_THR_bits_t              UART_THR;      /**< Offset: 0x1C ( /W  32) Transmit Holding Register */
  __IO  __UART_BRGR_bits_t             UART_BRGR;     /**< Offset: 0x20 (R/W  32) Baud Rate Generator Register */
  __IO  __UART_CMPR_bits_t             UART_CMPR;     /**< Offset: 0x24 (R/W  32) Comparison Register */
  __I   uint8_t                        Reserved1[0xBC];
  __IO  __UART_WPMR_bits_t             UART_WPMR;     /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
} uart_registers_t;
/** @}  end of Universal Asynchronous Receiver Transmitter */

#endif /* _PIC32CZ_CA70_UART_COMPONENT_H_ */
